## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

### Создание базы данных «Интернет-магазин книг»

В MySQL очищаем схему mydb (удаляем все таблицы):
```mysql
DROP SCHEMA IF EXISTS mydb;
CREATE DATABASE mydb;
USE mydb;
```

In [24]:
%%sql
CREATE TABLE author(
    author_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_author VARCHAR(50)
);

INSERT INTO author (name_author)
VALUES
    ('Булгаков М.А.'),
    ('Достоевский Ф.М.'),
    ('Есенин С.А.'),
    ('Пастернак Б.Л.'),
    ('Лермонтов М.Ю.');

SELECT * FROM author;

 * mysql://root:***@localhost/mydb
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.'),
 (5, 'Лермонтов М.Ю.')]

In [25]:
%%sql
CREATE TABLE genre(
    genre_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_genre VARCHAR(30)
);

INSERT INTO genre(name_genre)
VALUES ('Роман'),
       ('Поэзия'),
       ('Приключения');

SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
0 rows affected.
3 rows affected.
3 rows affected.

[(1, 'Роман'), (2, 'Поэзия'), (3, 'Приключения')]

In [26]:
%%sql
CREATE TABLE book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2),
    amount INT,
    FOREIGN KEY (author_id) REFERENCES author (author_id) ON DELETE CASCADE,
    FOREIGN KEY (genre_id) REFERENCES genre (genre_id) ON DELETE SET NULL
);

INSERT INTO book(title, author_id, genre_id, price, amount)
VALUES
    ('Мастер и Маргарита', 1, 1, 670.99, 3),
    ('Белая гвардия', 1, 1, 540.50, 5),
    ('Идиот', 2, 1, 460.00, 10),
    ('Братья Карамазовы', 2, 1, 799.01, 2),
    ('Игрок', 2, 1, 480.50, 10),
    ('Стихотворения и поэмы', 3, 2, 650.00, 15),
    ('Черный человек', 3, 2, 570.20, 6),
    ('Лирика', 4, 2, 518.99, 2);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
8 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 2),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]

In [27]:
%%sql
CREATE TABLE city (
    city_id       INT PRIMARY KEY AUTO_INCREMENT,
    name_city     VARCHAR(30),
    days_delivery INT
);

INSERT INTO city(name_city, days_delivery)
VALUES ('Москва', 5),
       ('Санкт-Петербург', 3),
       ('Владивосток', 12);

SELECT * FROM city;

 * mysql://root:***@localhost/mydb
0 rows affected.
3 rows affected.
3 rows affected.

[(1, 'Москва', 5), (2, 'Санкт-Петербург', 3), (3, 'Владивосток', 12)]

In [28]:
%%sql
CREATE TABLE IF NOT EXISTS client (
    client_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_client VARCHAR(50),
    city_id     INT,
    email       VARCHAR(30),
    FOREIGN KEY (city_id) REFERENCES city (city_id)
);

INSERT INTO client(name_client, city_id, email)
VALUES
    ('Баранов Павел', 3, 'baranov@test'),
    ('Абрамова Катя', 1, 'abramova@test'),
    ('Семенонов Иван', 2, 'semenov@test'),
    ('Яковлева Галина', 1, 'yakovleva@test');

SELECT * FROM client;

 * mysql://root:***@localhost/mydb
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Баранов Павел', 3, 'baranov@test'),
 (2, 'Абрамова Катя', 1, 'abramova@test'),
 (3, 'Семенонов Иван', 2, 'semenov@test'),
 (4, 'Яковлева Галина', 1, 'yakovleva@test')]

In [29]:
%%sql
CREATE TABLE IF NOT EXISTS buy (
    buy_id          INT PRIMARY KEY AUTO_INCREMENT,
    buy_description TEXT,
    client_id       INT DEFAULT (NULL),
    FOREIGN KEY (client_id) REFERENCES client (client_id)
);

INSERT INTO buy (buy_description, client_id)
VALUES ('Доставка только вечером', 1),
       (NULL, 3),
       ('Упаковать каждую книгу по отдельности', 2),
       (NULL, 1);

SELECT * FROM buy;

 * mysql://root:***@localhost/mydb
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Доставка только вечером', 1),
 (2, None, 3),
 (3, 'Упаковать каждую книгу по отдельности', 2),
 (4, None, 1)]

In [30]:
%%sql
CREATE TABLE IF NOT EXISTS buy_book (
    buy_book_id INT PRIMARY KEY AUTO_INCREMENT,
    buy_id      INT,
    book_id     INT,
    amount      INT,
    FOREIGN KEY (buy_id) REFERENCES buy (buy_id),
    FOREIGN KEY (book_id) REFERENCES book (book_id)
);

INSERT INTO buy_book(buy_id, book_id, amount)
VALUES
    (1, 1, 1),
    (1, 7, 2),
    (1, 3, 1),
    (2, 8, 2),
    (3, 3, 2),
    (3, 2, 1),
    (3, 1, 1),
    (4, 5, 1);

SELECT * FROM buy_book;

 * mysql://root:***@localhost/mydb
0 rows affected.
8 rows affected.
8 rows affected.

[(1, 1, 1, 1),
 (2, 1, 7, 2),
 (3, 1, 3, 1),
 (4, 2, 8, 2),
 (5, 3, 3, 2),
 (6, 3, 2, 1),
 (7, 3, 1, 1),
 (8, 4, 5, 1)]

In [31]:
%%sql
CREATE TABLE IF NOT EXISTS step (
    step_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_step VARCHAR(30)
);

INSERT INTO step(name_step)
VALUES
    ('Оплата'),
    ('Упаковка'),
    ('Транспортировка'),
    ('Доставка');

SELECT * FROM step;

 * mysql://root:***@localhost/mydb
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Оплата'), (2, 'Упаковка'), (3, 'Транспортировка'), (4, 'Доставка')]

In [32]:
%%sql
CREATE TABLE buy_step (
    buy_step_id INT PRIMARY KEY AUTO_INCREMENT,
    buy_id INT,
    step_id INT,
    date_step_beg DATE,
    date_step_end DATE,
    FOREIGN KEY (buy_id) REFERENCES buy (buy_id),
    FOREIGN KEY (step_id) REFERENCES step (step_id)
);

INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end)
VALUES
    (1, 1, '2020-02-20', '2020-02-20'),
    (1, 2, '2020-02-20', '2020-02-21'),
    (1, 3, '2020-02-22', '2020-03-07'),
    (1, 4, '2020-03-08', '2020-03-08'),
    (2, 1, '2020-02-28', '2020-02-28'),
    (2, 2, '2020-02-29', '2020-03-01'),
    (2, 3, '2020-03-02', NULL),
    (2, 4, NULL, NULL),
    (3, 1, '2020-03-05', '2020-03-05'),
    (3, 2, '2020-03-05', '2020-03-06'),
    (3, 3, '2020-03-06', '2020-03-10'),
    (3, 4, '2020-03-11', NULL),
    (4, 1, '2020-03-20', NULL),
    (4, 2, NULL, NULL),
    (4, 3, NULL, NULL),
    (4, 4, NULL, NULL);

SELECT * FROM buy_step;

 * mysql://root:***@localhost/mydb
0 rows affected.
16 rows affected.
16 rows affected.

[(1, 1, 1, datetime.date(2020, 2, 20), datetime.date(2020, 2, 20)),
 (2, 1, 2, datetime.date(2020, 2, 20), datetime.date(2020, 2, 21)),
 (3, 1, 3, datetime.date(2020, 2, 22), datetime.date(2020, 3, 7)),
 (4, 1, 4, datetime.date(2020, 3, 8), datetime.date(2020, 3, 8)),
 (5, 2, 1, datetime.date(2020, 2, 28), datetime.date(2020, 2, 28)),
 (6, 2, 2, datetime.date(2020, 2, 29), datetime.date(2020, 3, 1)),
 (7, 2, 3, datetime.date(2020, 3, 2), None),
 (8, 2, 4, None, None),
 (9, 3, 1, datetime.date(2020, 3, 5), datetime.date(2020, 3, 5)),
 (10, 3, 2, datetime.date(2020, 3, 5), datetime.date(2020, 3, 6)),
 (11, 3, 3, datetime.date(2020, 3, 6), datetime.date(2020, 3, 10)),
 (12, 3, 4, datetime.date(2020, 3, 11), None),
 (13, 4, 1, datetime.date(2020, 3, 20), None),
 (14, 4, 2, None, None),
 (15, 4, 3, None, None),
 (16, 4, 4, None, None)]

## 2.4.5 Запросы на основе трех и более связанных таблиц

Вывести все заказы Баранова Павла (**id** заказа, какие книги, по какой цене и в каком количестве он заказал) в отсортированном по номеру заказа и названиям книг виде.

In [34]:
%%sql
SELECT
    buy.buy_id,
    book.title,
    book.price,
    buy_book.amount
FROM
    client
    INNER JOIN buy USING(client_id)
    INNER JOIN buy_book USING(buy_id)
    INNER JOIN book USING(book_id)
WHERE
    client.name_client = 'Баранов Павел'
ORDER BY
    buy.buy_id ASC,
    book.title ASC;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Идиот', Decimal('460.00'), 1),
 (1, 'Мастер и Маргарита', Decimal('670.99'), 1),
 (1, 'Черный человек', Decimal('570.20'), 2),
 (4, 'Игрок', Decimal('480.50'), 1)]

## 2.4.6 Задание

Посчитать, сколько раз была заказана каждая книга, для книги вывести ее автора (нужно посчитать, в каком количестве заказов фигурирует каждая книга).  Вывести фамилию и инициалы автора, название книги, последний столбец назвать **Количество**. Результат отсортировать сначала  по фамилиям авторов, а потом по названиям книг.

In [35]:
%%sql
SELECT
    author.name_author,
    book.title,
    COUNT(buy_book.amount) AS Количество
FROM
    author
    INNER JOIN book USING(author_id)
    LEFT OUTER JOIN buy_book USING(book_id)
GROUP BY
    author.name_author,
    book.title
ORDER BY
    author.name_author ASC,
    book.title ASC;

 * mysql://root:***@localhost/mydb
8 rows affected.

[('Булгаков М.А.', 'Белая гвардия', 1),
 ('Булгаков М.А.', 'Мастер и Маргарита', 2),
 ('Достоевский Ф.М.', 'Братья Карамазовы', 0),
 ('Достоевский Ф.М.', 'Игрок', 1),
 ('Достоевский Ф.М.', 'Идиот', 2),
 ('Есенин С.А.', 'Стихотворения и поэмы', 0),
 ('Есенин С.А.', 'Черный человек', 1),
 ('Пастернак Б.Л.', 'Лирика', 1)]

## 2.4.7 Задание

Вывести города, в которых живут клиенты, оформлявшие заказы в интернет-магазине. Указать количество заказов в каждый город, этот столбец назвать **Количество**. Информацию вывести по убыванию количества заказов, а затем в алфавитном порядке по названию городов.

In [36]:
%%sql
SELECT
    name_city,
    COUNT(name_city) AS Количество
FROM
    city
    JOIN client USING(city_id)
    JOIN buy USING(client_id)
GROUP BY
    name_city
ORDER BY
    Количество DESC,
    name_city ASC;

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Владивосток', 2), ('Москва', 1), ('Санкт-Петербург', 1)]

## 2.4.8 Задание

Вывести номера всех оплаченных заказов и даты, когда они были оплачены.

In [37]:
%%sql
SELECT
    buy_step.buy_id,
    buy_step.date_step_end
FROM
    step
    JOIN buy_step USING(step_id)
WHERE
    buy_step.date_step_end IS NOT Null AND
    step.name_step = 'Оплата';

 * mysql://root:***@localhost/mydb
3 rows affected.

[(1, datetime.date(2020, 2, 20)),
 (2, datetime.date(2020, 2, 28)),
 (3, datetime.date(2020, 3, 5))]

## 2.4.9 Задание

Вывести информацию о каждом заказе: его номер, кто его сформировал (фамилия пользователя) и его стоимость (сумма произведений количества заказанных книг и их цены), в отсортированном по номеру заказа виде. Последний столбец назвать **Стоимость**.

In [38]:
%%sql
SELECT
    buy_book.buy_id,
    client.name_client,
    SUM(book.price * buy_book.amount) AS Стоимость
FROM
    book
    JOIN buy_book USING(book_id)
    JOIN buy USING(buy_id)
    JOIN client USING(client_id)
GROUP BY
    buy_book.buy_id
ORDER BY
    buy_book.buy_id ASC;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Баранов Павел', Decimal('2271.39')),
 (2, 'Семенонов Иван', Decimal('1037.98')),
 (3, 'Абрамова Катя', Decimal('2131.49')),
 (4, 'Баранов Павел', Decimal('480.50'))]

## 2.4.10 Задание

Вывести номера заказов (**buy_id**) и названия этапов,  на которых они в данный момент находятся. Если заказ доставлен –  информацию о нем не выводить. Информацию отсортировать по возрастанию **buy_id**.

**Пояснение**: Текущим  считается тот этап, для которого заполнена дата начала этапа и не заполнена дата его окончания.

In [39]:
%%sql
SELECT
    buy_id,
    name_step
FROM
    step
    JOIN buy_step USING(step_id)
WHERE
    date_step_beg IS NOT Null AND
    date_step_end IS Null
ORDER BY
    buy_id;

 * mysql://root:***@localhost/mydb
3 rows affected.

[(2, 'Транспортировка'), (3, 'Доставка'), (4, 'Оплата')]

## 2.4.11 Задание

В таблице **city** для каждого города указано количество дней, за которые заказ может быть доставлен в этот город (рассматривается только этап **Транспортировка**). Для тех заказов, которые прошли этап транспортировки, вывести количество дней за которое заказ реально доставлен в город. А также, если заказ доставлен с опозданием, указать количество дней задержки, в противном случае вывести 0. В результат включить номер заказа (**buy_id**), а также вычисляемые столбцы **Количество_дней** и **Опоздани**е. Информацию вывести в отсортированном по номеру заказа виде.

In [40]:
%%sql
SELECT
    buy_step.buy_id,
    DATEDIFF(date_step_end, date_step_beg) AS Количество_дней,
    IF(DATEDIFF(date_step_end, date_step_beg) - days_delivery > 0,
       DATEDIFF(date_step_end, date_step_beg) - days_delivery, 0) AS Опоздание
FROM
    city
    JOIN client USING(city_id)
    JOIN buy USING(client_id)
    JOIN buy_step USING(buy_id)
    JOIN step USING(step_id)
WHERE
    name_step = 'Транспортировка' AND
    date_step_end IS NOT Null
ORDER BY
    buy_step.buy_id;

 * mysql://root:***@localhost/mydb
2 rows affected.

[(1, 14, 2), (3, 4, 0)]

## 2.4.12 Задание

Выбрать всех клиентов, которые заказывали книги Достоевского, информацию вывести в отсортированном по алфавиту виде. В решении используйте фамилию автора, а не его **id**.

In [41]:
%%sql
SELECT
    DISTINCT name_client
FROM
    author
    JOIN book USING(author_id)
    JOIN buy_book USING(book_id)
    JOIN buy USING(buy_id)
    JOIN client USING(client_id)
WHERE
    name_author = 'Достоевский Ф.М.'
ORDER BY
    name_client ASC;

 * mysql://root:***@localhost/mydb
2 rows affected.

[('Абрамова Катя',), ('Баранов Павел',)]

## 2.4.13 Задание

Вывести жанр (или жанры), в котором было заказано больше всего экземпляров книг, указать это количество. Последний столбец назвать **Количество**.

In [42]:
%%sql
SELECT
    name_genre,
    SUM(buy_book.amount) as Количество
FROM
    genre
    JOIN book USING(genre_id)
    JOIN buy_book USING(book_id)
GROUP BY
    name_genre
HAVING
    SUM(buy_book.amount) = (
        SELECT MAX(sum_amount)
        FROM (
            SELECT
                SUM(buy_book.amount) AS sum_amount
            FROM
                genre
                JOIN book USING(genre_id)
                JOIN buy_book USING(book_id)
            GROUP BY
                name_genre) max_amount
    );

 * mysql://root:***@localhost/mydb
1 rows affected.

[('Роман', Decimal('7'))]

## 2.4.14 Задание

Сравнить ежемесячную выручку от продажи книг за текущий и предыдущий годы. Для этого вывести год, месяц, сумму выручки в отсортированном сначала по возрастанию месяцев, затем по возрастанию лет виде. Название столбцов: **Год**, **Месяц**, **Сумма**.

Добавляем таблицу **buy_archive**:

In [43]:
%%sql
DROP TABLE IF EXISTS buy_archive;

CREATE TABLE buy_archive
(
    buy_archive_id INT PRIMARY KEY AUTO_INCREMENT,
    buy_id         INT,
    client_id      INT,
    book_id        INT,
    date_payment   DATE,
    price          DECIMAL(8, 2),
    amount         INT
);

INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price)
VALUES (2, 1, 1, '2019-02-21', 2, 670.60),
       (2, 1, 3, '2019-02-21', 1, 450.90),
       (1, 2, 2, '2019-02-10', 2, 520.30),
       (1, 2, 4, '2019-02-10', 3, 780.90),
       (1, 2, 3, '2019-02-10', 1, 450.90),
       (3, 4, 4, '2019-03-05', 4, 780.90),
       (3, 4, 5, '2019-03-05', 2, 480.90),
       (4, 1, 6, '2019-03-12', 1, 650.00),
       (5, 2, 1, '2019-03-18', 2, 670.60),
       (5, 2, 4, '2019-03-18', 1, 780.90);

SELECT * FROM buy_archive;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
10 rows affected.
10 rows affected.

[(1, 2, 1, 1, datetime.date(2019, 2, 21), Decimal('670.60'), 2),
 (2, 2, 1, 3, datetime.date(2019, 2, 21), Decimal('450.90'), 1),
 (3, 1, 2, 2, datetime.date(2019, 2, 10), Decimal('520.30'), 2),
 (4, 1, 2, 4, datetime.date(2019, 2, 10), Decimal('780.90'), 3),
 (5, 1, 2, 3, datetime.date(2019, 2, 10), Decimal('450.90'), 1),
 (6, 3, 4, 4, datetime.date(2019, 3, 5), Decimal('780.90'), 4),
 (7, 3, 4, 5, datetime.date(2019, 3, 5), Decimal('480.90'), 2),
 (8, 4, 1, 6, datetime.date(2019, 3, 12), Decimal('650.00'), 1),
 (9, 5, 2, 1, datetime.date(2019, 3, 18), Decimal('670.60'), 2),
 (10, 5, 2, 4, datetime.date(2019, 3, 18), Decimal('780.90'), 1)]

In [44]:
%%sql
SELECT
    YEAR(date_payment) AS Год,
    MONTHNAME(date_payment) AS Месяц,
    SUM(amount * price) AS Сумма
FROM
    buy_archive
GROUP BY
    YEAR(date_payment),
    MONTHNAME(date_payment)
UNION ALL
SELECT
    YEAR(date_step_end) AS Год,
    MONTHNAME(date_step_end) AS Месяц,
    SUM(buy_book.amount * price) AS Сумма
FROM 
    book 
    INNER JOIN buy_book USING(book_id)
    INNER JOIN buy USING(buy_id) 
    INNER JOIN buy_step USING(buy_id)
    INNER JOIN step USING(step_id)
WHERE
    buy_step.date_step_end IS NOT Null AND
    name_step = "Оплата"
GROUP BY
    YEAR(date_step_end),
    MONTHNAME(date_step_end)
ORDER BY
    Месяц;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(2019, 'February', Decimal('5626.30')),
 (2020, 'February', Decimal('3309.37')),
 (2019, 'March', Decimal('6857.50')),
 (2020, 'March', Decimal('2131.49'))]

## 2.4.15 Задание

Для каждой отдельной книги необходимо вывести информацию о количестве проданных экземпляров и их стоимости за 2020 и 2019 год. Вычисляемые столбцы назвать **Количество** и **Сумма**. Информацию отсортировать по убыванию стоимости.

In [45]:
%%sql
SELECT
    title,
    SUM(Количество) AS Количество,
    SUM(Сумма) AS Сумма
FROM (
    SELECT
        title,
        SUM(buy_archive.amount) AS Количество,
        SUM(buy_archive.amount * buy_archive.price) AS Сумма
    FROM
        buy_archive
        INNER JOIN book USING(book_id)
    GROUP BY
        title
    UNION ALL
    SELECT
        title,
        SUM(buy_book.amount) AS Количество,
        SUM(buy_book.amount * price) AS Сумма
    FROM 
        book 
        INNER JOIN buy_book USING(book_id)
        INNER JOIN buy USING(buy_id) 
        INNER JOIN buy_step USING(buy_id)
        INNER JOIN step USING(step_id)
    WHERE
        buy_step.date_step_end IS NOT Null AND
        name_step = "Оплата"
    GROUP BY
        title) query_in
GROUP BY
    title
ORDER BY
    Сумма DESC;

 * mysql://root:***@localhost/mydb
8 rows affected.

[('Братья Карамазовы', Decimal('8'), Decimal('6247.20')),
 ('Мастер и Маргарита', Decimal('6'), Decimal('4024.38')),
 ('Идиот', Decimal('5'), Decimal('2281.80')),
 ('Белая гвардия', Decimal('3'), Decimal('1581.10')),
 ('Черный человек', Decimal('2'), Decimal('1140.40')),
 ('Лирика', Decimal('2'), Decimal('1037.98')),
 ('Игрок', Decimal('2'), Decimal('961.80')),
 ('Стихотворения и поэмы', Decimal('1'), Decimal('650.00'))]